system.org
#+TITLE: Masamune
#+STARTUP: overview
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="finishing-touches.css"/>

* Introduction

If you're reading via github's rendition of org-mode, try the spiffy HTML version [[http://gabriel-laddel.github.io/system.html][here]]. Read [[./arsttep.html][this]] if you're unsure as to what Masamune is.

Inline code snippets =look like this=.

* Installing

Until such a time that portage can be hacked through in some sane manner, we must install Masamune on top of funtoo. This is a time consuming PITA. Apologies. Follow the [[./Funtoo_Linux_Installation.htm ][Funtoo Linux Installation]] (locally cached to prevent shitgnomery), using the following replacements for sections of the same name. If you attempt to =emerge whatever= and get output resembling 

#+BEGIN_SRC
root@rainbowdash ~ # emerge www-client/google-chrome-unstable

 * IMPORTANT: 3 news items need reading for repository 'gentoo'.
 * Use eselect news to read news items.


 * IMPORTANT: config file '/etc/portage/package.use' needs updating.
 * See the CONFIGURATION FILES section of the emerge
 * man page to learn how to update config files.
Calculating dependencies  ... done!
[ebuild  N     ] gnome-base/gconf-3.2.6-r3  USE="-debug -introspection -ldap -policykit" PYTHON_TARGETS="python2_7" 
[ebuild  N    ~] www-client/google-chrome-unstable-41.0.2224.3_p1  USE="plugins" LINGUAS="am ar bg bn ca cs da de el en_GB es es_LA et fa fi fil fr gu he hi hr hu id it ja kn ko lt lv ml mr ms nb nl pl pt_BR pt_PT ro ru sk sl sr sv sw ta te th tr uk vi zh_CN zh_TW" 

The following keyword changes are necessary to proceed:
 (see "package.accept_keywords" in the portage(5) man page for more details)
# required by www-client/google-chrome-unstable (argument)
=www-client/google-chrome-unstable-41.0.2224.3_p1 ~amd64

The following license changes are necessary to proceed:
 (see "package.license" in the portage(5) man page for more details)
# required by www-client/google-chrome-unstable (argument)
>=www-client/google-chrome-unstable-41.0.2224.3_p1 google-chrome

Use --autounmask-write to write changes to config files (honoring
CONFIG_PROTECT). Carefully examine the list of proposed changes,
paying special attention to mask or keyword changes that may expose
experimental or unstable packages.
root@rainbowdash ~ # 
#+END_SRC

You need to add

#+BEGIN_SRC
=www-client/google-chrome-unstable-41.0.2224.3_p1 ~amd64
>=www-client/google-chrome-unstable-41.0.2224.3_p1 google-chrome
#+END_SRC

To the file =/etc/portage/package.use=. There may be an automated way of doing this, but idk.

** Live CD

Install SystemrescueCD [[http://www.sysresccd.org/Sysresccd-manual-en_How_to_install_SystemRescueCd_on_an_USB-stick][on a USB stick]]. The "script in the root of the CD-rom" doesn't work. Run =bash ./usb_inst.sh --help= and then each step individually. When you start system rescue CD, use *Standard 64bit kernel (rescue64) > SystemRescueCd with the default graphical environment*. If you need to use colemak, dvorak

#+BEGIN_SRC
setxkbmap us -variant colemak -option ctrl:nocaps
#+END_SRC

from the terminal after the graphical env has started.

* Installing the Stage 3 tarball

Instead of the stage3 tarball supplied by funtoo, download [[https://drive.google.com/file/d/0Bznn0f9Mk3KAalRUVHJCeDROYWs/view?usp=sharing][this one]]. The SystemrescueCD web browser is borked and will falsely indicate it has been fully downloaded almost immediately. Wait until a desktop popup message appears in the top right corner.

#+BEGIN_SRC
cd /mnt/funtoo
mv /root/stage3-old.tar.xz ./
tar xpf stage3-old.tar.xz

# It is very important to use tar's "p" option when extracting the Stage 3
# tarball - it tells tar to preserve any permissions and ownership that exist
# within the archive. Without this option, your Funtoo Linux filesystem
# permissions will be incorrect. 

mount -t proc none proc
mount --rbind /sys sys
mount --rbind /dev dev
cp /etc/resolv.conf etc
env -i HOME=/root TERM=$TERM chroot . bash -l
emerge --sync
#+END_SRC

Edit =/etc/fstab= to reflect the filesystem layout (using =nano -w /etc/fstab=). E.G.,

#+BEGIN_SRC
# The root filesystem should have a pass number of either 0 or 1.
# All other filesystems should have a pass number of 0 or greater than 1.
#
# NOTE: If your BOOT partition is ReiserFS, add the notail option to opts.
#
# See the manpage fstab(5) for more information.
#
# <fs>	     <mountpoint>  <type>  <opts>         <dump/pass>

/dev/sda1    /boot         ext2    noauto,noatime 1 2
/dev/sda2    none          swap    sw             0 0
/dev/sda3    /             ext4    noatime        0 1
#/dev/cdrom  /mnt/cdrom    auto    noauto,ro      0 0
#+END_SRC

#+BEGIN_SRC
echo MAKEOPTS=\"-j$(($(nproc) + 1))\" >> /etc/portage/make.conf
#+END_SRC

