system.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Masamune</title>
<!-- 2015-05-28 Thu 13:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="finishing-touches.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Masamune</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Installing</a>
<ul>
<li><a href="#sec-2-1">2.1. Live CD</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Installing the Stage 3 tarball</a>
<ul>
<li><a href="#sec-3-1">3.1. Kernel</a></li>
<li><a href="#sec-3-2">3.2. Installing a Bootloader</a></li>
<li><a href="#sec-3-3">3.3. Configuring your network &gt; Wi-fi</a></li>
<li><a href="#sec-3-4">3.4. Funtoo Linux First Steps</a></li>
</ul>
</li>
<li><a href="#sec-4">4. FAQ</a>
<ul>
<li><a href="#sec-4-1">4.1. <span class="todo TODO">TODO</span> how does on set hostname permanently on gentoo?</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Developers</a>
<ul>
<li><a href="#sec-5-1">5.1. Debugging</a></li>
<li><a href="#sec-5-2">5.2. Dealing with C</a></li>
</ul>
</li>
<li><a href="#sec-6">6. TODOs</a>
<ul>
<li><a href="#sec-6-1">6.1. alpha</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. <span class="todo TODO">TODO</span> point swank/slime to asdf sources or move them into the appropriate location.</a></li>
<li><a href="#sec-6-1-2">6.1.2. <span class="todo TODO">TODO</span> update portage build</a></li>
<li><a href="#sec-6-1-3">6.1.3. <span class="todo TODO">TODO</span> app-emacs/imaxima must be installed to have working latex support</a></li>
<li><a href="#sec-6-1-4">6.1.4. <span class="todo TODO">TODO</span> possibly integrate</a></li>
<li><a href="#sec-6-1-5">6.1.5. <span class="todo TODO">TODO</span> automate installation</a></li>
<li><a href="#sec-6-1-6">6.1.6. <span class="todo TODO">TODO</span> install sbcl to correct location or point emacs to correct sources</a></li>
<li><a href="#sec-6-1-7">6.1.7. <span class="todo TODO">TODO</span> leverage portage USE to ensure that systemd is not pulled in under any circumstances</a></li>
<li><a href="#sec-6-1-8">6.1.8. <span class="todo TODO">TODO</span> lock lisp code + clone stable optima / Alexandria combination</a></li>
<li><a href="#sec-6-1-9">6.1.9. <span class="todo TODO">TODO</span> unified documentation</a></li>
<li><a href="#sec-6-1-10">6.1.10. <span class="todo TODO">TODO</span> remove all text editors other than emacs/climacs</a></li>
<li><a href="#sec-6-1-11">6.1.11. <span class="todo TODO">TODO</span> bind debugger in all threads</a></li>
<li><a href="#sec-6-1-12">6.1.12. <span class="todo TODO">TODO</span> move all data storage into PCLOS</a></li>
<li><a href="#sec-6-1-13">6.1.13. <span class="todo TODO">TODO</span> add all pen testing tools</a></li>
<li><a href="#sec-6-1-14">6.1.14. <span class="todo TODO">TODO</span> NixOS etc. automatically determine drivers something something kernel modules. How?</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2. beta</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. <span class="todo TODO">TODO</span> unify console mode and graphical UNIX</a></li>
<li><a href="#sec-6-2-2">6.2.2. <span class="todo TODO">TODO</span> review common lisp style guides and codify</a></li>
<li><a href="#sec-6-2-3">6.2.3. <span class="todo TODO">TODO</span> unified kill ring</a></li>
<li><a href="#sec-6-2-4">6.2.4. <span class="todo TODO">TODO</span> 'unwind' maxima and move to asdf + quicklisp</a></li>
<li><a href="#sec-6-2-5">6.2.5. <span class="todo TODO">TODO</span> improve plotting facilities</a></li>
<li><a href="#sec-6-2-6">6.2.6. <span class="todo TODO">TODO</span> commission sexp printer, reader for haskell's Language.C.AST</a></li>
<li><a href="#sec-6-2-7">6.2.7. <span class="todo TODO">TODO</span> translate dependency plotting to CL</a></li>
<li><a href="#sec-6-2-8">6.2.8. <span class="todo TODO">TODO</span> advice system</a></li>
<li><a href="#sec-6-2-9">6.2.9. <span class="todo TODO">TODO</span> HATRED</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. gamma</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. <span class="todo TODO">TODO</span> pdf OCR</a></li>
<li><a href="#sec-6-3-2">6.3.2. <span class="todo TODO">TODO</span> cleanup CL ecosystem</a></li>
<li><a href="#sec-6-3-3">6.3.3. <span class="todo TODO">TODO</span> lispy audio</a></li>
<li><a href="#sec-6-3-4">6.3.4. <span class="todo TODO">TODO</span> common lisp only editor</a></li>
<li><a href="#sec-6-3-5">6.3.5. <span class="todo TODO">TODO</span> removing X</a></li>
<li><a href="#sec-6-3-6">6.3.6. <span class="todo TODO">TODO</span> adopt all good ideas from related technologies</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
If you're reading via github's rendition of org-mode, try the spiffy HTML version <a href="http://gabriel-laddel.github.io/system.html">here</a>. Read <a href="./arsttep.html">this</a> if you're unsure as to what Masamune is.
</p>

<p>
Inline code snippets <code>look like this</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installing</h2>
<div class="outline-text-2" id="text-2">
<p>
Until such a time that portage can be hacked through in some sane manner, we must install Masamune on top of funtoo. This is a time consuming PITA. Apologies. Follow the <a href="./Funtoo_Linux_Installation.htm ">Funtoo Linux Installation</a> (locally cached to prevent shitgnomery), using the following replacements for sections of the same name. If you attempt to <code>emerge whatever</code> and get output resembling 
</p>

<pre class="example">
root@rainbowdash ~ # emerge www-client/google-chrome-unstable

 * IMPORTANT: 3 news items need reading for repository 'gentoo'.
 * Use eselect news to read news items.


 * IMPORTANT: config file '/etc/portage/package.use' needs updating.
 * See the CONFIGURATION FILES section of the emerge
 * man page to learn how to update config files.
Calculating dependencies  ... done!
[ebuild  N     ] gnome-base/gconf-3.2.6-r3  USE="-debug -introspection -ldap -policykit" PYTHON_TARGETS="python2_7" 
[ebuild  N    ~] www-client/google-chrome-unstable-41.0.2224.3_p1  USE="plugins" LINGUAS="am ar bg bn ca cs da de el en_GB es es_LA et fa fi fil fr gu he hi hr hu id it ja kn ko lt lv ml mr ms nb nl pl pt_BR pt_PT ro ru sk sl sr sv sw ta te th tr uk vi zh_CN zh_TW" 

The following keyword changes are necessary to proceed:
 (see "package.accept_keywords" in the portage(5) man page for more details)
# required by www-client/google-chrome-unstable (argument)
=www-client/google-chrome-unstable-41.0.2224.3_p1 ~amd64

The following license changes are necessary to proceed:
 (see "package.license" in the portage(5) man page for more details)
# required by www-client/google-chrome-unstable (argument)
&gt;=www-client/google-chrome-unstable-41.0.2224.3_p1 google-chrome

Use --autounmask-write to write changes to config files (honoring
CONFIG_PROTECT). Carefully examine the list of proposed changes,
paying special attention to mask or keyword changes that may expose
experimental or unstable packages.
root@rainbowdash ~ #
</pre>

<p>
You need to add
</p>

<pre class="example">
=www-client/google-chrome-unstable-41.0.2224.3_p1 ~amd64
&gt;=www-client/google-chrome-unstable-41.0.2224.3_p1 google-chrome
</pre>

<p>
To the file <code>/etc/portage/package.use</code>. There may be an automated way of doing this, but idk.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Live CD</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Install SystemrescueCD <a href="http://www.sysresccd.org/Sysresccd-manual-en_How_to_install_SystemRescueCd_on_an_USB-stick">on a USB stick</a>. The "script in the root of the CD-rom" doesn't work. Run <code>bash ./usb_inst.sh --help</code> and then each step individually. When you start system rescue CD, use <b>Standard 64bit kernel (rescue64) &gt; SystemRescueCd with the default graphical environment</b>. If you need to use colemak, dvorak
</p>

<pre class="example">
setxkbmap us -variant colemak -option ctrl:nocaps
</pre>

<p>
from the terminal after the graphical env has started.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installing the Stage 3 tarball</h2>
<div class="outline-text-2" id="text-3">
<p>
Instead of the stage3 tarball supplied by funtoo, download <a href="https://drive.google.com/file/d/0Bznn0f9Mk3KAalRUVHJCeDROYWs/view?usp=sharing">this one</a>. The SystemrescueCD web browser is borked and will falsely indicate it has been fully downloaded almost immediately. Wait until a desktop popup message appears in the top right corner.
</p>

<pre class="example">
cd /mnt/funtoo
mv /root/stage3-old.tar.xz ./
tar xpf stage3-old.tar.xz

# It is very important to use tar's "p" option when extracting the Stage 3
# tarball - it tells tar to preserve any permissions and ownership that exist
# within the archive. Without this option, your Funtoo Linux filesystem
# permissions will be incorrect. 

mount -t proc none proc
mount --rbind /sys sys
mount --rbind /dev dev
cp /etc/resolv.conf etc
env -i HOME=/root TERM=$TERM chroot . bash -l
emerge --sync
</pre>

<p>
Edit <code>/etc/fstab</code> to reflect the filesystem layout (using <code>nano -w /etc/fstab</code>). E.G.,
</p>

<pre class="example">
# The root filesystem should have a pass number of either 0 or 1.
# All other filesystems should have a pass number of 0 or greater than 1.
#
# NOTE: If your BOOT partition is ReiserFS, add the notail option to opts.
#
# See the manpage fstab(5) for more information.
#
# &lt;fs&gt;	     &lt;mountpoint&gt;  &lt;type&gt;  &lt;opts&gt;         &lt;dump/pass&gt;

/dev/sda1    /boot         ext2    noauto,noatime 1 2
/dev/sda2    none          swap    sw             0 0
/dev/sda3    /             ext4    noatime        0 1
#/dev/cdrom  /mnt/cdrom    auto    noauto,ro      0 0
</pre>

<pre class="example">
echo MAKEOPTS=\"-j$(($(nproc) + 1))\" &gt;&gt; /etc/portage/make.conf
</pre>
</div>
