system.org
** Kernel

The kernel is packaged in the stage3 tarball. The following will build it. This will take over an hour.

#+BEGIN_SRC
install -d /etc/portage/sets && echo 'sys-kernel/debian-sources' >> /etc/portage/sets/kernel && emerge -1 @kernel 
#+END_SRC

** Installing a Bootloader

=emerge boot-update=, edit (=nano -w /unix/filename/=) =/etc/boot.conf= to

#+BEGIN_SRC
boot {
	generate grub
	default "Funtoo Linux genkernel" 
	timeout 3 
}

"Funtoo Linux" {
	kernel bzImage[-v]
}

"Funtoo Linux genkernel" {
	kernel kernel[-v]
	initrd initramfs[-v]
	params += real_root=auto rootfstype=auto
} 

"Funtoo Linux better-initramfs" {
	kernel vmlinuz[-v]
	initrd /initramfs.cpio.gz
}
#+END_SRC

#+BEGIN_SRC
grub-install --target=i386-pc --no-floppy /dev/sda
boot-update
#+END_SRC

** Configuring your network > Wi-fi

#+BEGIN_SRC bash
emerge linux-firmware
emerge networkmanager 
rc-update add NetworkManager default
#+END_SRC

NetworkManager includes an ncurses gui (available via =nmtui=), which is far more convenient than futzing around with shell commands. Fair warning, =emerge networkmanager= takes ~1hr.

** Funtoo Linux First Steps

You can skip the [[http://www.funtoo.org/Funtoo_Linux_First_Steps][Funtoo Linux First Steps]] page. Setup internet via =nmtui=. AFAIK there doesn't exist a canonical hardware to drivers mapping and video drivers must be installed by hand. This amounts to

#+BEGIN_SRC
echo 'VIDEO_CARDS="funtoo-specific-chipset-id"' >> /etc/portage/make.conf # determine the chipset-id using the guide here http://www.funtoo.org/Video
emerge video-driver-name
#+END_SRC

Choosing the right driver will probably require some guesswork. The guides to the [[http://www.funtoo.org/X_Window_System][X window system]] and [[http://www.funtoo.org/Video][Video hardware]] will prove useful. If your setup isn't documented run =emerge -s driver= at the shell to get a list of all drivers. You can get some information about your chipset with =uname -a=. (NOTE: if you find that you need to do this, you may want to =emerge emacs= so you can look through the output. Otherwise, shift-page-up/down will scroll through console output).

#+BEGIN_SRC common-lisp
(defvar known-configurations
  ("Compaq Presario CQ57" (:x11-driver "x11-drivers/xf86-video-intel" :make-conf "VIDEO_CARDS=\"intel\""))
  ("dell precision m4400" (:x11-driver "x11-base/xorg-drivers" :make-conf "VIDEO_CARDS=\"nouveau\"")))
#+END_SRC

IFF you've managed to install video drivers, it is time to build the ALGOL systems required by Masamune

#+BEGIN_SRC
export SBCL_HOME=/usr/lib64/sbcl # sadly this is required, the SBCL build in portage doesn't work because idiots.
emerge sbcl

# emerge each of these, adding whatever necessary to package.use

virtual/jpeg
media-libs/tiff
media-libs/giflib
x11-libs/libXpm
x11-base/xorg-drivers # required on almost all chips. even those that need x11-drivers/xf86-video-intel. Installing it can't hurt.
x11-base/xorg-x11
app-text/enchant
app-text/ghostscript-gpl
media-gfx/imagemagick
sys-apps/lshw
net-wireless/aircrack-ng
app-text/sloccount
app-misc/mc
net-analyzer/nmap
sys-process/htop
net-analyzer/netcat
x11-apps/xrandr
x11-misc/xcalib 
x11-apps/xdpyinfo
xterm

mkdir -p ~/quicklisp/local-projects/
cd ~/quicklisp/local-projects/
git clone https://github.com/gabriel-laddel/masamune.git
curl http://beta.quicklisp.org/quicklisp.lisp > /tmp/quicklisp.lisp
sbcl --load /tmp/quicklisp.lisp

# evaluate (quicklisp-quickstart:install) when prompted,
# then evaluate
# 
# (ql:add-to-init-file)
# 
# press RET and
# 
# (quit)
# 
# if you run into an SB-BSD-SOCKETS:TRY-AGAIN-ERROR activate the ABORT restart
# and retry. Perhaps it is just my flaky connection, but this appears to be
# rather common.

cd
sbcl --load ~/quicklisp/local-projects/masamune/build/install-initialize.lisp

cd ~/quicklisp/local-projects/emacs-24.4/
./configure
make
make install

cd ~/quicklisp/local-projects/stumpwm/
autoconf
./configure
make
make install

emerge conkeror

mkdir -p ~/algol/xulrunner/
curl http://ftp.mozilla.org/pub/mozilla.org/xulrunner/releases/33.1/runtimes/xulrunner-33.1.en-US.linux-x86_64.tar.bz2 > /tmp/xulrunner-33.1.en-US.linux-x86_64.tar.bz2
mv /tmp/xulrunner-33.1.en-US.linux-x86_64.tar.bz2 ~/algol/ && cd ~/algol/ && tar xvjf xulrunner-33.1.en-US.linux-x86_64.tar.bz2
chmod +x ~/algol/xulrunner/xulrunner

# check that it works via ~/algol/xulrunner/xulrunner --version

mkdir ~/algol/conkeror/
cd ~/algol/conkeror/
git init
git remote add origin git://repo.or.cz/conkeror.git
git fetch origin 48d3ef4369f267faf42451a580b1ac6bcb6a5a18:refs/remotes/origin/master
git reset --hard FETCH_HEAD
make # required if one wishes to edit text fields from emacs

cd
emerge app-emacs/imaxima
startx

# the rest of the install process is automated from this point and will boot
# into a tutorial. If you run into errors, let me know in #bitcoin-assets on
# freenode (for live help) or register an issue on github. 
#+END_SRC

* FAQ

Q: Invalid MIT-MAGIC-COOKIE-1 keyError - Can't open display :0.0

Your hostname isn't permanently set and has been changed because idiots. Restore it using =hostname old-hostname-string=.

Info from: https://bbs.archlinux.org/viewtopic.php?id=159573

** TODO how does on set hostname permanently on gentoo?

Q: When the browser starts it also launches several windows corresponding to failed downloads. How can I remove them?

A: M-x download-remove from each one of the windows before killing with stumpwm

* Developers
** Debugging

I don't really understand how to go about debugging ALGOL programs. This section exists to dump debugging hacks that might not be obvious to a n00b (i.e., me).

=journalctl --no-pager=

http://jvns.ca/blog/2014/04/20/debug-your-programs-like-theyre-closed-source/

** Dealing with C

Linux is a gigantic mass of C code an there isn't, afaik, much in the way of sane tooling (e.g., find all who call, or reference $CONSTRUCT). The Haskell package [[https://hackage.haskell.org/package/language-c-0.4.4/docs/Language-C-Syntax-AST.html][Language.C.syntax.AST]] can parse the entire linux kernel. Pay a haskellite to add a sexpr interface?

* TODOs
** alpha
*** TODO point swank/slime to asdf sources or move them into the appropriate location.
*** TODO update portage build

=emerge sci-visualization/gnuplot=

add the following to =/etc/portage/package.use=

=media-libs/gd-2.0.35-r4=

WTF why doesn't this work?

