system.html

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Kernel</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The kernel is packaged in the stage3 tarball. The following will build it. This will take over an hour.
</p>

<pre class="example">
install -d /etc/portage/sets &amp;&amp; echo 'sys-kernel/debian-sources' &gt;&gt; /etc/portage/sets/kernel &amp;&amp; emerge -1 @kernel
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Installing a Bootloader</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>emerge boot-update</code>, edit (<code>nano -w /unix/filename/</code>) <code>/etc/boot.conf</code> to
</p>

<pre class="example">
boot {
	generate grub
	default "Funtoo Linux genkernel" 
	timeout 3 
}

"Funtoo Linux" {
	kernel bzImage[-v]
}

"Funtoo Linux genkernel" {
	kernel kernel[-v]
	initrd initramfs[-v]
	params += real_root=auto rootfstype=auto
} 

"Funtoo Linux better-initramfs" {
	kernel vmlinuz[-v]
	initrd /initramfs.cpio.gz
}
</pre>

<pre class="example">
grub-install --target=i386-pc --no-floppy /dev/sda
boot-update
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Configuring your network &gt; Wi-fi</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-bash">emerge linux-firmware
emerge networkmanager 
rc-update add NetworkManager default
</pre>
</div>

<p>
NetworkManager includes an ncurses gui (available via <code>nmtui</code>), which is far more convenient than futzing around with shell commands. Fair warning, <code>emerge networkmanager</code> takes ~1hr.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Funtoo Linux First Steps</h3>
<div class="outline-text-3" id="text-3-4">
<p>
You can skip the <a href="http://www.funtoo.org/Funtoo_Linux_First_Steps">Funtoo Linux First Steps</a> page. Setup internet via <code>nmtui</code>. AFAIK there doesn't exist a canonical hardware to drivers mapping and video drivers must be installed by hand. This amounts to
</p>

<pre class="example">
echo 'VIDEO_CARDS="funtoo-specific-chipset-id"' &gt;&gt; /etc/portage/make.conf # determine the chipset-id using the guide here http://www.funtoo.org/Video
emerge video-driver-name
</pre>

<p>
Choosing the right driver will probably require some guesswork. The guides to the <a href="http://www.funtoo.org/X_Window_System">X window system</a> and <a href="http://www.funtoo.org/Video">Video hardware</a> will prove useful. If your setup isn't documented run <code>emerge -s driver</code> at the shell to get a list of all drivers. You can get some information about your chipset with <code>uname -a</code>. (NOTE: if you find that you need to do this, you may want to <code>emerge emacs</code> so you can look through the output. Otherwise, shift-page-up/down will scroll through console output).
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(defvar known-configurations
  ("Compaq Presario CQ57" (:x11-driver "x11-drivers/xf86-video-intel" :make-conf "VIDEO_CARDS=\"intel\""))
  ("dell precision m4400" (:x11-driver "x11-base/xorg-drivers" :make-conf "VIDEO_CARDS=\"nouveau\"")))
</pre>
</div>

<p>
IFF you've managed to install video drivers, it is time to build the ALGOL systems required by Masamune
</p>

<pre class="example">
export SBCL_HOME=/usr/lib64/sbcl # sadly this is required, the SBCL build in portage doesn't work because idiots.
emerge sbcl

# emerge each of these, adding whatever necessary to package.use

virtual/jpeg
media-libs/tiff
media-libs/giflib
x11-libs/libXpm
x11-base/xorg-drivers # required on almost all chips. even those that need x11-drivers/xf86-video-intel. Installing it can't hurt.
x11-base/xorg-x11
app-text/enchant
app-text/ghostscript-gpl
media-gfx/imagemagick
sys-apps/lshw
net-wireless/aircrack-ng
app-text/sloccount
app-misc/mc
net-analyzer/nmap
sys-process/htop
net-analyzer/netcat
x11-apps/xrandr
x11-misc/xcalib 
x11-apps/xdpyinfo
xterm

mkdir -p ~/quicklisp/local-projects/
cd ~/quicklisp/local-projects/
git clone https://github.com/gabriel-laddel/masamune.git
curl http://beta.quicklisp.org/quicklisp.lisp &gt; /tmp/quicklisp.lisp
sbcl --load /tmp/quicklisp.lisp

# evaluate (quicklisp-quickstart:install) when prompted,
# then evaluate
# 
# (ql:add-to-init-file)
# 
# press RET and
# 
# (quit)
# 
# if you run into an SB-BSD-SOCKETS:TRY-AGAIN-ERROR activate the ABORT restart
# and retry. Perhaps it is just my flaky connection, but this appears to be
# rather common.

cd
sbcl --load ~/quicklisp/local-projects/masamune/build/install-initialize.lisp

cd ~/quicklisp/local-projects/emacs-24.4/
./configure
make
make install

cd ~/quicklisp/local-projects/stumpwm/
autoconf
./configure
make
make install

emerge conkeror

mkdir -p ~/algol/xulrunner/
curl http://ftp.mozilla.org/pub/mozilla.org/xulrunner/releases/33.1/runtimes/xulrunner-33.1.en-US.linux-x86_64.tar.bz2 &gt; /tmp/xulrunner-33.1.en-US.linux-x86_64.tar.bz2
mv /tmp/xulrunner-33.1.en-US.linux-x86_64.tar.bz2 ~/algol/ &amp;&amp; cd ~/algol/ &amp;&amp; tar xvjf xulrunner-33.1.en-US.linux-x86_64.tar.bz2
chmod +x ~/algol/xulrunner/xulrunner

# check that it works via ~/algol/xulrunner/xulrunner --version

mkdir ~/algol/conkeror/
cd ~/algol/conkeror/
git init
git remote add origin git://repo.or.cz/conkeror.git
git fetch origin 48d3ef4369f267faf42451a580b1ac6bcb6a5a18:refs/remotes/origin/master
git reset --hard FETCH_HEAD
make # required if one wishes to edit text fields from emacs

cd
emerge app-emacs/imaxima
startx

# the rest of the install process is automated from this point and will boot
# into a tutorial. If you run into errors, let me know in #bitcoin-assets on
# freenode (for live help) or register an issue on github.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> FAQ</h2>
<div class="outline-text-2" id="text-4">
<p>
Q: Invalid MIT-MAGIC-COOKIE-1 keyError - Can't open display :0.0
</p>

<p>
Your hostname isn't permanently set and has been changed because idiots. Restore it using <code>hostname old-hostname-string</code>.
</p>

<p>
Info from: <a href="https://bbs.archlinux.org/viewtopic.php?id=159573">https://bbs.archlinux.org/viewtopic.php?id=159573</a>
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> how does on set hostname permanently on gentoo?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Q: When the browser starts it also launches several windows corresponding to failed downloads. How can I remove them?
</p>

<p>
A: M-x download-remove from each one of the windows before killing with stumpwm
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Developers</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Debugging</h3>
<div class="outline-text-3" id="text-5-1">
<p>
I don't really understand how to go about debugging ALGOL programs. This section exists to dump debugging hacks that might not be obvious to a n00b (i.e., me).
</p>

<p>
<code>journalctl --no-pager</code>
</p>

<p>
<a href="http://jvns.ca/blog/2014/04/20/debug-your-programs-like-theyre-closed-source/">http://jvns.ca/blog/2014/04/20/debug-your-programs-like-theyre-closed-source/</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Dealing with C</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Linux is a gigantic mass of C code an there isn't, afaik, much in the way of sane tooling (e.g., find all who call, or reference $CONSTRUCT). The Haskell package <a href="https://hackage.haskell.org/package/language-c-0.4.4/docs/Language-C-Syntax-AST.html">Language.C.syntax.AST</a> can parse the entire linux kernel. Pay a haskellite to add a sexpr interface?
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> TODOs</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> alpha</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> <span class="todo TODO">TODO</span> point swank/slime to asdf sources or move them into the appropriate location.</h4>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> <span class="todo TODO">TODO</span> update portage build</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
<code>emerge sci-visualization/gnuplot</code>
</p>

<p>
add the following to <code>/etc/portage/package.use</code>
</p>

<p>
<code>media-libs/gd-2.0.35-r4</code>
</p>

<p>
WTF why doesn't this work?
</p>
</div>
</div>
