system.html

<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> <span class="todo TODO">TODO</span> app-emacs/imaxima must be installed to have working latex support</h4>
</div>
<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> <span class="todo TODO">TODO</span> possibly integrate</h4>
<div class="outline-text-4" id="text-6-1-4">
<ul class="org-ul">
<li>cl-store
</li>
<li><a href="https://github.com/vermiculus/sx.el/blob/master/README.org">https://github.com/vermiculus/sx.el/blob/master/README.org</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-1-5" class="outline-4">
<h4 id="sec-6-1-5"><span class="section-number-4">6.1.5</span> <span class="todo TODO">TODO</span> automate installation</h4>
</div>
<div id="outline-container-sec-6-1-6" class="outline-4">
<h4 id="sec-6-1-6"><span class="section-number-4">6.1.6</span> <span class="todo TODO">TODO</span> install sbcl to correct location or point emacs to correct sources</h4>
</div>
<div id="outline-container-sec-6-1-7" class="outline-4">
<h4 id="sec-6-1-7"><span class="section-number-4">6.1.7</span> <span class="todo TODO">TODO</span> leverage portage USE to ensure that systemd is not pulled in under any circumstances</h4>
</div>
<div id="outline-container-sec-6-1-8" class="outline-4">
<h4 id="sec-6-1-8"><span class="section-number-4">6.1.8</span> <span class="todo TODO">TODO</span> lock lisp code + clone stable optima / Alexandria combination</h4>
<div class="outline-text-4" id="text-6-1-8">
<p>
I ran into an issue with a combination of optima / alexandria that can be resolved by loading the following commits:
</p>

<p>
Optima commit: b2b9e325e09f8c9af1abf7dedc3b072e23318a70 
Alexandria commit: b1c6ee0
</p>
</div>
</div>

<div id="outline-container-sec-6-1-9" class="outline-4">
<h4 id="sec-6-1-9"><span class="section-number-4">6.1.9</span> <span class="todo TODO">TODO</span> unified documentation</h4>
<div class="outline-text-4" id="text-6-1-9">
<p>
The portage USE flag 'doc' will cause circular dependencies by default. Debug?
</p>
</div>
</div>

<div id="outline-container-sec-6-1-10" class="outline-4">
<h4 id="sec-6-1-10"><span class="section-number-4">6.1.10</span> <span class="todo TODO">TODO</span> remove all text editors other than emacs/climacs</h4>
</div>
<div id="outline-container-sec-6-1-11" class="outline-4">
<h4 id="sec-6-1-11"><span class="section-number-4">6.1.11</span> <span class="todo TODO">TODO</span> bind debugger in all threads</h4>
<div class="outline-text-4" id="text-6-1-11">
<p>
currently errors get nesed up to sb-kernel:*maximum-error-depth* when I attempt to join an IRC channel from the knowledge map
</p>
</div>
</div>

<div id="outline-container-sec-6-1-12" class="outline-4">
<h4 id="sec-6-1-12"><span class="section-number-4">6.1.12</span> <span class="todo TODO">TODO</span> move all data storage into PCLOS</h4>
<div class="outline-text-4" id="text-6-1-12">
<p>
the system <code>(ql:quickload '(fmarshal fmarshal-test))</code> can store most types of data - integrate with manardb.
</p>
</div>
</div>

<div id="outline-container-sec-6-1-13" class="outline-4">
<h4 id="sec-6-1-13"><span class="section-number-4">6.1.13</span> <span class="todo TODO">TODO</span> add all pen testing tools</h4>
</div>
<div id="outline-container-sec-6-1-14" class="outline-4">
<h4 id="sec-6-1-14"><span class="section-number-4">6.1.14</span> <span class="todo TODO">TODO</span> NixOS etc. automatically determine drivers something something kernel modules. How?</h4>
<div class="outline-text-4" id="text-6-1-14">
<p>
compare with portage genkernel
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> beta</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> <span class="todo TODO">TODO</span> unify console mode and graphical UNIX</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
The correct way to address the situation is to:
</p>

<ol class="org-ol">
<li>when the user is first dropped into console mode, query as to the keyboard to be used: dvorak, colemak and qwerty
</li>

<li>ensure that a modern Emacs with SLIME and a CL compiler are available.
</li>

<li>document in some fashion (probably info pages) all of the things that you can possibly do in this mode.
</li>

<li>when the user is dropped into console mode for some reason, list all possible commands and promt them to assign them to keys and show them where the documentation describing console mode is while within emacs.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-elisp">(progn
 (defun console-mode-colemak ()
  "XXX probably only works on my machine"
  (interactive)
  (save-window-excursion 
    (find-file "/tmp/caps-to-control.map")
    (with-current-buffer "caps-to-control.map"
      (erase-buffer)
      (insert 
       "keycode 58 = Control\n"
       "alt_is_meta\n"
       (shell-command-to-string "dumpkeys | head -1"))
       (save-buffer)))
  (shell-command-to-string "loadkeys /usr/share/keymaps/i386/colemak/en-latin9.map.gz")
  (shell-command-to-string "loadkeys /tmp/caps-to-control.map"))
(console-mode-colemak))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> <span class="todo TODO">TODO</span> review common lisp style guides and codify</h4>
</div>
<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> <span class="todo TODO">TODO</span> unified kill ring</h4>
</div>
<div id="outline-container-sec-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> <span class="todo TODO">TODO</span> 'unwind' maxima and move to asdf + quicklisp</h4>
</div>
<div id="outline-container-sec-6-2-5" class="outline-4">
<h4 id="sec-6-2-5"><span class="section-number-4">6.2.5</span> <span class="todo TODO">TODO</span> improve plotting facilities</h4>
</div>
<div id="outline-container-sec-6-2-6" class="outline-4">
<h4 id="sec-6-2-6"><span class="section-number-4">6.2.6</span> <span class="todo TODO">TODO</span> commission sexp printer, reader for haskell's Language.C.AST</h4>
</div>
<div id="outline-container-sec-6-2-7" class="outline-4">
<h4 id="sec-6-2-7"><span class="section-number-4">6.2.7</span> <span class="todo TODO">TODO</span> translate dependency plotting to CL</h4>
<div class="outline-text-4" id="text-6-2-7">
<p>
<a href="http://code.google.com/p/yjl/source/browse/Miscellaneous/PDepGraph.py">http://code.google.com/p/yjl/source/browse/Miscellaneous/PDepGraph.py</a>
<a href="http://yjl.googlecode.com/hg/Miscellaneous/PDepGraph.py">http://yjl.googlecode.com/hg/Miscellaneous/PDepGraph.py</a>
</p>
</div>
</div>

<div id="outline-container-sec-6-2-8" class="outline-4">
<h4 id="sec-6-2-8"><span class="section-number-4">6.2.8</span> <span class="todo TODO">TODO</span> advice system</h4>
<div class="outline-text-4" id="text-6-2-8">
<ul class="org-ul">
<li>translate advice.el
</li>
<li><a href="http://www.lispworks.com/documentation/lw445/LWRM/html/lwref-268.htm">http://www.lispworks.com/documentation/lw445/LWRM/html/lwref-268.htm</a>
</li>
<li><a href="http://www.cs.cmu.edu/afs/cs/project/clisp/hackers/phg/clim/src/utils/clos-patches.lisp">http://www.cs.cmu.edu/afs/cs/project/clisp/hackers/phg/clim/src/utils/clos-patches.lisp</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-2-9" class="outline-4">
<h4 id="sec-6-2-9"><span class="section-number-4">6.2.9</span> <span class="todo TODO">TODO</span> HATRED</h4>
<div class="outline-text-4" id="text-6-2-9">
<ol class="org-ol">
<li>Networking. I wanted to send a file to another machine connected to me via Ethernet cable and cannot. All the stackoverflow questions on the matter are utterly useless. There isn't any documentation to look at that would allow me to understand the networking protocol.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> gamma</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> <span class="todo TODO">TODO</span> pdf OCR</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
All the citations must be clickable, and when you click on them, they open up the linked paper, or tell you where it is located (i.e. behind a paywall). I don't want plaintext output, but rather a better format with the exact same formatting as the original pdf that allows me to click, drag-and-drop and add new content. The authors etc should all be programmatically accessible "new content" should be anything I wish - 3D etc. all the data used to perform the computations should have a "warning - unlinked &lt;location of data, who is responsible for it&gt;" unless a human resolved it to the correct source and bundled it along with the paper.
</p>

<p>
The docview program for Emacs converts .pdfs into .png files for viewing. Use this in 'batch mode' to prep for OCR, hack the remainder onto this.
</p>
</div>
</div>
