system.org
*** TODO lispy audio

#+BEGIN_SRC
# for emacspeaks

flite -voice kal16 -t testing
#+END_SRC

review the following codebases

- pocket sphinx
- sphinx2
- sphinx3
- sphinxbase
- cl-pulseaudio

*** TODO common lisp only editor

see https://github.com/capitaomorte/sly for a rethinking of SLIME+SWANK. In the
new Lisp editor there are a few things that are needed out of the box we don't
have today in anything else.  persistant, cl-ppcre searchable rings, slime eval,
eval in frame etc. that (possibly) specializes on the place in the 'global-tree'
of such things.

- when I change the name of a function or its arglist, register a pending request to update all of the calls to the function.

- keep track of all undefined functions etc. within the program even after an individual sexpr is compiled

- keep track of "" matching within and nested strings?

- with-open-file autocompletion (ie, just give me a stream name and complete symbols - can other forms use type inference to determine intermediate symbol names? I generally don't care much what they're called)

- full english / todo editing integrated into the comments

- index all codebases loaded into the lisp image for commands like `who-calls'

- detect invalid lambda-lists

- testing out of the box + stats on what is untested & tested

- apropos (cl-ppcre regex)

- smart updates of packages and .asd files according to your exports at the repl

- better autodocs

- autocompletion everywhere that works across packages (ie, pathnames, names should complete in both repl and buffers)

- structure editing /only/

- multiple repls

- repl into other boxes trivially

- better inspector - if I've a image / video / audio on one of my objects I should be able to see it

- renaming files should update the .asd and also take care of any documentation references.

- smart renaming mechanisms, smart argument list changes- notify me what else needs to be updated when I update a function -- this should carry through to the documentation of the codebase

- 'flavors' of asdf-compiling a system, that is, "fast" "debuggable"

**** TODO removing Emacs

Emacs is currently kept around to perform the following tasks

- reading info files

- reading pdfs
    
- Magit
 
At some point in time someone sane will get fed up with git and write a CL-aware alternative, but until then we're stuck with Magit. Or we could just ditch git which performs a /very/ basic task and is a massive pos.

*** TODO removing X

relevent codebases,

https://github.com/pyb/zen
http://www.cliki.net/CLX-CURSOR
http://www.cliki.net/CLX-TRUETYPE
http://xcb.freedesktop.org/XmlXcb/
[[http://www.cliki.net/Acclaim][drawings directly on the screen using CLX]]
http://www.cliki.net/CL-VECTORS
[[http://users.actrix.co.nz/mycroft/event.lisp][CLX events]]
[[http://common-lisp.net/project/cmucl/doc/clx/][CLX manual]]
[[http://www.cawtech.demon.co.uk/clx/simple/examples.html][tutorial of using CLX]]
[[https://github.com/filonenko-mikhail/clx-xkeyboard][If we could get rid of the X keyboard system entirely that would be great.]]

*** TODO adopt all good ideas from related technologies
**** ankisrs.net
***** pros
***** cons
**** Knewton
***** pros
***** cons

Their product is currently not (and will never be?) open to the public. Thus it has no future.

**** Khan Academy
***** pros   
***** cons

- there is far too much going on visually.

- I'm not entirely sold on the idea of hints - generally speaking, you either
  understand something, or not. It's not as if seeing a 'hint' (part of the
  solution) is going to jump start your brain into understanding. If I don't
  understand show exactly how the solution was derived and call it "show
  solution". Renaming it to 'hint' is dishonest.

- It's rather irritating that I can't sign up for a course / lesson / path and resume where I left off.
     
- Not personalized enough - when it knows the language I use and other such settings.
     
- resource intensive - slow, causes chrome to crash
     
- The concepts they teach are all relatively sophomoric. 
     
- doesn't allow for mastery, as in, it's a technology that punishes experts.
     
- there isn't a clear flow when practicing skills
     
- Overload of points and notifications / badges, and it's not clear what they represent, or what their value is.
     
- the community page is far too cluttered
     
- on the 'mission' page there is far too much going on. You really only need one progress bar.
     
- Logos suck
     
- There isn't a GO button, or any clear way to quickly set off from what you were last learning.
     
- Okay, yes, the UI is friendly, but it's also insulting to my intelligence. Where are my options, settings etc?
     
- HTML5 back button doesn't work like you would expect
     
- slow
     
- Problems should fit on the screen

- I can scroll down when I'm in the middle of solving problems. Irritating, especially since there isn't anything there.
	  
- If I get something correct, automatically move me onto the next problem
     
- When I get to the end of a task and see the task dashboard, there isn't a 'continue' button. This breaks my flow.
     
- the graphs / dashboard visualizations don't fit together to form a coherent whole. How much have I learned of the subject, course, mission? I've nfi. What is the purpose of the metrics you're showing me?

- I want an introduction to the concepts used to structure information within their program, but nothing is available. I know what a coach is irl, but no idea what it means on your system.

- it's not clear where to get started if I want to learn something new or spend my time browsing around - probably b/c the concepts are not clearly defined.
      
**** clever
***** pros
***** cons
**** EdX
***** pros
***** cons
**** Coursera
***** pros
***** cons
**** brilliant.org
***** pros
***** cons
**** quizlet
***** pros
***** cons

- slow

**** elm-art

http://art2.ph-freiburg.de/Lisp-Course     
