system.html

<div id="outline-container-sec-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> <span class="todo TODO">TODO</span> lispy audio</h4>
<div class="outline-text-4" id="text-6-3-3">
<pre class="example">
# for emacspeaks

flite -voice kal16 -t testing
</pre>

<p>
review the following codebases
</p>

<ul class="org-ul">
<li>pocket sphinx
</li>
<li>sphinx2
</li>
<li>sphinx3
</li>
<li>sphinxbase
</li>
<li>cl-pulseaudio
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> <span class="todo TODO">TODO</span> common lisp only editor</h4>
<div class="outline-text-4" id="text-6-3-4">
<p>
see <a href="https://github.com/capitaomorte/sly">https://github.com/capitaomorte/sly</a> for a rethinking of SLIME+SWANK. In the
new Lisp editor there are a few things that are needed out of the box we don't
have today in anything else.  persistant, cl-ppcre searchable rings, slime eval,
eval in frame etc. that (possibly) specializes on the place in the 'global-tree'
of such things.
</p>

<ul class="org-ul">
<li>when I change the name of a function or its arglist, register a pending request to update all of the calls to the function.
</li>

<li>keep track of all undefined functions etc. within the program even after an individual sexpr is compiled
</li>

<li>keep track of "" matching within and nested strings?
</li>

<li>with-open-file autocompletion (ie, just give me a stream name and complete symbols - can other forms use type inference to determine intermediate symbol names? I generally don't care much what they're called)
</li>

<li>full english / todo editing integrated into the comments
</li>

<li>index all codebases loaded into the lisp image for commands like `who-calls'
</li>

<li>detect invalid lambda-lists
</li>

<li>testing out of the box + stats on what is untested &amp; tested
</li>

<li>apropos (cl-ppcre regex)
</li>

<li>smart updates of packages and .asd files according to your exports at the repl
</li>

<li>better autodocs
</li>

<li>autocompletion everywhere that works across packages (ie, pathnames, names should complete in both repl and buffers)
</li>

<li>structure editing <i>only</i>
</li>

<li>multiple repls
</li>

<li>repl into other boxes trivially
</li>

<li>better inspector - if I've a image / video / audio on one of my objects I should be able to see it
</li>

<li>renaming files should update the .asd and also take care of any documentation references.
</li>

<li>smart renaming mechanisms, smart argument list changes- notify me what else needs to be updated when I update a function &#x2013; this should carry through to the documentation of the codebase
</li>

<li>'flavors' of asdf-compiling a system, that is, "fast" "debuggable"
</li>
</ul>
</div>

<ol class="org-ol"><li><a id="sec-6-3-4-1" name="sec-6-3-4-1"></a><span class="todo TODO">TODO</span> removing Emacs<br  /><div class="outline-text-5" id="text-6-3-4-1">
<p>
Emacs is currently kept around to perform the following tasks
</p>

<ul class="org-ul">
<li>reading info files
</li>

<li>reading pdfs
</li>

<li>Magit
</li>
</ul>

<p>
At some point in time someone sane will get fed up with git and write a CL-aware alternative, but until then we're stuck with Magit. Or we could just ditch git which performs a <i>very</i> basic task and is a massive pos.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-6-3-5" class="outline-4">
<h4 id="sec-6-3-5"><span class="section-number-4">6.3.5</span> <span class="todo TODO">TODO</span> removing X</h4>
<div class="outline-text-4" id="text-6-3-5">
<p>
relevent codebases,
</p>

<p>
<a href="https://github.com/pyb/zen">https://github.com/pyb/zen</a>
<a href="http://www.cliki.net/CLX-CURSOR">http://www.cliki.net/CLX-CURSOR</a>
<a href="http://www.cliki.net/CLX-TRUETYPE">http://www.cliki.net/CLX-TRUETYPE</a>
<a href="http://xcb.freedesktop.org/XmlXcb/">http://xcb.freedesktop.org/XmlXcb/</a>
<a href="http://www.cliki.net/Acclaim">drawings directly on the screen using CLX</a>
<a href="http://www.cliki.net/CL-VECTORS">http://www.cliki.net/CL-VECTORS</a>
<a href="http://users.actrix.co.nz/mycroft/event.lisp">CLX events</a>
<a href="http://common-lisp.net/project/cmucl/doc/clx/">CLX manual</a>
<a href="http://www.cawtech.demon.co.uk/clx/simple/examples.html">tutorial of using CLX</a>
<a href="https://github.com/filonenko-mikhail/clx-xkeyboard">If we could get rid of the X keyboard system entirely that would be great.</a>
</p>
</div>
</div>

<div id="outline-container-sec-6-3-6" class="outline-4">
<h4 id="sec-6-3-6"><span class="section-number-4">6.3.6</span> <span class="todo TODO">TODO</span> adopt all good ideas from related technologies</h4>
<div class="outline-text-4" id="text-6-3-6">
</div><ol class="org-ol"><li><a id="sec-6-3-6-1" name="sec-6-3-6-1"></a>ankisrs.net<br  /><ol class="org-ol"><li><a id="sec-6-3-6-1-1" name="sec-6-3-6-1-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-1-2" name="sec-6-3-6-1-2"></a>cons<br  /></li></ol>
</li>
<li><a id="sec-6-3-6-2" name="sec-6-3-6-2"></a>Knewton<br  /><ol class="org-ol"><li><a id="sec-6-3-6-2-1" name="sec-6-3-6-2-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-2-2" name="sec-6-3-6-2-2"></a>cons<br  /><div class="outline-text-6" id="text-6-3-6-2-2">
<p>
Their product is currently not (and will never be?) open to the public. Thus it has no future.
</p>
</div>
</li></ol>
</li>

<li><a id="sec-6-3-6-3" name="sec-6-3-6-3"></a>Khan Academy<br  /><ol class="org-ol"><li><a id="sec-6-3-6-3-1" name="sec-6-3-6-3-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-3-2" name="sec-6-3-6-3-2"></a>cons<br  /><div class="outline-text-6" id="text-6-3-6-3-2">
<ul class="org-ul">
<li>there is far too much going on visually.
</li>

<li>I'm not entirely sold on the idea of hints - generally speaking, you either
understand something, or not. It's not as if seeing a 'hint' (part of the
solution) is going to jump start your brain into understanding. If I don't
understand show exactly how the solution was derived and call it "show
solution". Renaming it to 'hint' is dishonest.
</li>

<li>It's rather irritating that I can't sign up for a course / lesson / path and resume where I left off.
</li>

<li>Not personalized enough - when it knows the language I use and other such settings.
</li>

<li>resource intensive - slow, causes chrome to crash
</li>

<li>The concepts they teach are all relatively sophomoric. 
</li>

<li>doesn't allow for mastery, as in, it's a technology that punishes experts.
</li>

<li>there isn't a clear flow when practicing skills
</li>

<li>Overload of points and notifications / badges, and it's not clear what they represent, or what their value is.
</li>

<li>the community page is far too cluttered
</li>

<li>on the 'mission' page there is far too much going on. You really only need one progress bar.
</li>

<li>Logos suck
</li>

<li>There isn't a GO button, or any clear way to quickly set off from what you were last learning.
</li>

<li>Okay, yes, the UI is friendly, but it's also insulting to my intelligence. Where are my options, settings etc?
</li>

<li>HTML5 back button doesn't work like you would expect
</li>

<li>slow
</li>

<li>Problems should fit on the screen
</li>

<li>I can scroll down when I'm in the middle of solving problems. Irritating, especially since there isn't anything there.
</li>

<li>If I get something correct, automatically move me onto the next problem
</li>

<li>When I get to the end of a task and see the task dashboard, there isn't a 'continue' button. This breaks my flow.
</li>

<li>the graphs / dashboard visualizations don't fit together to form a coherent whole. How much have I learned of the subject, course, mission? I've nfi. What is the purpose of the metrics you're showing me?
</li>

<li>I want an introduction to the concepts used to structure information within their program, but nothing is available. I know what a coach is irl, but no idea what it means on your system.
</li>

<li>it's not clear where to get started if I want to learn something new or spend my time browsing around - probably b/c the concepts are not clearly defined.
</li>
</ul>
</div>
</li></ol>
</li>

<li><a id="sec-6-3-6-4" name="sec-6-3-6-4"></a>clever<br  /><ol class="org-ol"><li><a id="sec-6-3-6-4-1" name="sec-6-3-6-4-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-4-2" name="sec-6-3-6-4-2"></a>cons<br  /></li></ol>
</li>
<li><a id="sec-6-3-6-5" name="sec-6-3-6-5"></a>EdX<br  /><ol class="org-ol"><li><a id="sec-6-3-6-5-1" name="sec-6-3-6-5-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-5-2" name="sec-6-3-6-5-2"></a>cons<br  /></li></ol>
</li>
<li><a id="sec-6-3-6-6" name="sec-6-3-6-6"></a>Coursera<br  /><ol class="org-ol"><li><a id="sec-6-3-6-6-1" name="sec-6-3-6-6-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-6-2" name="sec-6-3-6-6-2"></a>cons<br  /></li></ol>
</li>
<li><a id="sec-6-3-6-7" name="sec-6-3-6-7"></a>brilliant.org<br  /><ol class="org-ol"><li><a id="sec-6-3-6-7-1" name="sec-6-3-6-7-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-7-2" name="sec-6-3-6-7-2"></a>cons<br  /></li></ol>
</li>
<li><a id="sec-6-3-6-8" name="sec-6-3-6-8"></a>quizlet<br  /><ol class="org-ol"><li><a id="sec-6-3-6-8-1" name="sec-6-3-6-8-1"></a>pros<br  /></li>
<li><a id="sec-6-3-6-8-2" name="sec-6-3-6-8-2"></a>cons<br  /><div class="outline-text-6" id="text-6-3-6-8-2">
<ul class="org-ul">
<li>slow
</li>
</ul>
</div>
</li></ol>
</li>

<li><a id="sec-6-3-6-9" name="sec-6-3-6-9"></a>elm-art<br  /><div class="outline-text-5" id="text-6-3-6-9">
<p>
<a href="http://art2.ph-freiburg.de/Lisp-Course">http://art2.ph-freiburg.de/Lisp-Course</a>     
</p>
</div>
</li></ol>
</div>
</div>
</div>
</div>
</body>
</html>
